Filip83/ecos-devel/ecos-3.0/packages/devs/usb/kinetis/current/src/usbc_kinetis_zaloha.c
            if ((USB_ENDPOINT_DESCRIPTOR_ATTR_CONTROL == endpoint) && isSetup)
            {
                khciState->endpointState[(USB_ENDPOINT_DESCRIPTOR_ATTR_CONTROL << 1U) | USB_OUT].stateUnion.stateBitField.data0 = 1U;
                khciState->endpointState[(USB_ENDPOINT_DESCRIPTOR_ATTR_CONTROL << 1U) | USB_IN].stateUnion.stateBitField.data0 = 1U;
            }
            else
            {
                khciState->endpointState[index].stateUnion.stateBitField.data0 ^= 1U;
            }
            khciState->endpointState[index].stateUnion.stateBitField.bdtOdd ^= 1U;
            if ((!khciState->endpointState[index].transferLength) || (!remainingLength) ||
                (khciState->endpointState[index].stateUnion.stateBitField.maxPacketSize > length))
            {
                ep0.buffer_size = khciState->endpointState[index].transferDone;
                if (isSetup)
                {
                    //ep0.control_buffer = bdtBuffer;
                    memcpy(ep0.control_buffer, bdtBuffer, 8);
                   /* ep0.buffer_size = 0;
                    ep0.fill_buffer_fn = 0;
                    ep0.complete_fn = 0;
                    
                    usbs_kinetis_control_setup();
                    //message.buffer = bdtBuffer;*/
                }
                else
                {
                    ep0.buffer  = khciState->endpointState[index].transferBuffer;
                }
                khciState->endpointState[index].stateUnion.stateBitField.transferring = 0U;
            }
            else
            {
                /* Receive remaining data and terminate the token done interrupt service. */
                USB_DeviceKhciRecv(khciState, (endpoint) | (USB_OUT << 0x07U),
                                   khciState->endpointState[index].transferBuffer, remainingLength);
                return;
            }
        }
    }

    if(endpoint == 0)
    {
        if (direction == USB_OUT)
            usbs_kinetis_control_setup();
#if 1
        if (direction == USB_IN)
        {
            // Data was expected and received. Transfer the data to the
            // user's buffer, and perform completion.
            usbs_control_return result;
            
           /* CYG_ASSERT((usbs_control_return (*)(usbs_control_endpoint*, int))0 != ep0.common.complete_fn, \
                        "A completion function should be provided for OUT control messages");
            CYG_ASSERT(size == ep0.buffer_size, "Inconsistency between buffer and transfer sizes");*/
            /*memcpy(ep0.buffer, buffer, size);
            result = (*ep0.complete_fn)(&ep0, 0);
            ep0.buffer           = (unsigned char*) 0;
            ep0.buffer_size      = 0;
            ep0.complete_fn      = (usbs_control_return (*)(usbs_control_endpoint*, int)) 0;*/
            
             cyg_uint32 pos = 0;
                memcpy(kinetis_usb_device.setupPacketBuffer,
                       ep0.buffer,ep0.buffer_size);
                pos += ep0.buffer_size;
                while(ep0.fill_buffer_fn)
                {
                    if((ep0.buffer_size + pos) < USB_SETUP_PACKET_SIZE)
                    {
                        (*ep0.fill_buffer_fn) (&ep0);
                        memcpy(kinetis_usb_device.setupPacketBuffer + pos,
                               ep0.buffer,ep0.buffer_size);
                        pos += ep0.buffer_size;
                    }
                    else
                    {
                        CYG_ASSERT(false,"USB control buffer overflow\n");
                    }					
                }		

                ep0.buffer = kinetis_usb_device.setupPacketBuffer;
                ep0.buffer_size = pos;
                USB_DeviceKhciSend(&kinetis_usb_device,0,
                        ep0.buffer, ep0.buffer_size);
        }
        else
        {
            CYG_ASSERT(true, "IN Token for ep0 is unexpected.\n");
        }
#endif
    }
    else
    {
        usbs_rx_endpoint *pep = (usbs_rx_endpoint *) usbs_kinetis_endpoints[endpoint];

        /*CYG_ASSERT (UC3C_USB_ENDPOINTS > endpoint && endpoint, "Invalid end point");
        CYG_ASSERT (pep->complete_fn, "No complete_fn()");*/

        if (pep->complete_fn)
        {
            /* Do not check on pep->buffer_size != 0, user should
            * be allowed to send empty packet */
            // TODO: nevim jestli neni buffer modifikovany
            if (!pep->halted) 
            {
                (*pep->complete_fn) (buffer,size);
            } 
            else 
            {
                (*pep->complete_fn) (buffer, -EAGAIN);
            }
        }
    }
#if 0
    message.isSetup = isSetup;
    message.code = (endpoint) | (cyg_uint8)(((cyg_uint32)direction << 0x07U));

    /* Notify the up layer the KHCI status changed. */
    USB_DeviceNotificationTrigger(khciState->deviceHandle, &message);
#endif

    khciState->registerBase->CTL &= ~USB_CTL_TXSUSPENDTOKENBUSY_MASK;
}

/*!
 * @brief Handle the USB bus reset interrupt.
 *
 * The function is used to handle the USB bus reset interrupt.
 *
 * @param khciState       Pointer of the device KHCI state structure.
 *
 */
static void USB_DeviceKhciInterruptReset(usb_device_khci_state_struct_t *khciState)
{
    /* Set KHCI reset flag */
    khciState->isResetting = 1U;

    /* Clear the reset interrupt */
    khciState->registerBase->ISTAT = (kUSB_KhciInterruptReset);
#if ((defined(USB_DEVICE_CONFIG_LOW_POWER_MODE)) && (USB_DEVICE_CONFIG_LOW_POWER_MODE > 0U))
    /* Clear the suspend interrupt */
    khciState->registerBase->ISTAT = (kUSB_KhciInterruptSleep);
    khciState->registerBase->USBCTRL &= ~USB_USBCTRL_SUSP_MASK;
#endif

    /* Notify up layer the USB bus reset signal detected. */
    ep0.state = USBS_STATE_DEFAULT;
    usbs_state_notify(&ep0);
    khciState->isResetting = 0U;
}

/* The USB suspend and resume signals need to be detected and handled when the 
 * low power or remote wakeup function
 * enabled. */
#if (defined(USB_DEVICE_CONFIG_LOW_POWER_MODE) && (USB_DEVICE_CONFIG_LOW_POWER_MODE > 0U))

/*!
 * @brief Handle the suspend interrupt.
 *
 * The function is used to handle the suspend interrupt when the suspend signal 
 * detected.
 *
 * @param khciState       Pointer of the device KHCI state structure.
 *
 */
static void USB_DeviceKhciInterruptSleep(usb_device_khci_state_struct_t *khciState)
{
    /* Enable the resume interrupt */
    khciState->registerBase->INTEN |= kUSB_KhciInterruptResume;
    khciState->registerBase->USBTRC0 |= USB_USBTRC0_USBRESMEN_MASK;
    khciState->registerBase->USBCTRL |= USB_USBCTRL_SUSP_MASK;
    /* Disable the suspend interrupt */
    khciState->registerBase->INTEN &= ~((cyg_uint32)kUSB_KhciInterruptSleep);

