Filip83/ecos-devel/ecos-3.0/packages/devs/usb/kinetis/current/src/usbc_kinetis_zaloha.c
/******************************************************************************
 *   Functions to process setup packet.                                       *
 ******************************************************************************/

usbs_control_return
usbs_parse_host_get_command (usbs_control_endpoint * pcep)
{
    usbs_control_return retcode;
    cyg_uint8 dev_req_type =
      (((usb_devreq *) pcep->control_buffer)->type) & USB_DEVREQ_TYPE_MASK;

    switch (dev_req_type) {
    case USB_DEVREQ_TYPE_STANDARD:
        if (!pcep->standard_control_fn) {
          return usbs_handle_standard_control (pcep);
        }

        retcode =
          (*pcep->standard_control_fn) (pcep, pcep->standard_control_data);

        if (retcode == USBS_CONTROL_RETURN_UNKNOWN) {
          return usbs_handle_standard_control (pcep);
        }
        return retcode;

    case USB_DEVREQ_TYPE_CLASS:
        if (!pcep->class_control_fn) {
          return USBS_CONTROL_RETURN_STALL;
        }
        return (*pcep->class_control_fn) (pcep, pcep->class_control_data);

    case USB_DEVREQ_TYPE_VENDOR:
        if (!pcep->class_control_fn) {
            return USBS_CONTROL_RETURN_STALL;
        }
        return (*pcep->class_control_fn) (pcep, pcep->vendor_control_data);

    case USB_DEVREQ_TYPE_RESERVED:
        if (!pcep->reserved_control_fn) {
            return USBS_CONTROL_RETURN_STALL;
        }
        return (*pcep->reserved_control_fn) (pcep, pcep->reserved_control_data);
    default:
        return USBS_CONTROL_RETURN_STALL;
    }
}

// Handle a get status setup message on the control end point
 usbs_control_return
usbs_kinetis_control_setup_get_status(void)
{
    usbs_control_return status = USBS_CONTROL_RETURN_UNKNOWN;
    usb_device_endpoint_status_struct_t ep_status;
    usb_devreq *req = (usb_devreq *)ep0.control_buffer;
    cyg_uint8 recipient = req->type & USB_DEVREQ_RECIPIENT_MASK;
    
    ep_status.endpointAddress = req->index_lo;
    
    cyg_uint16 word = 0;

    switch (recipient) {
    case USB_DEVREQ_RECIPIENT_DEVICE:
    case USB_DEVREQ_RECIPIENT_INTERFACE:
        // Nothing to do
      break;
    case USB_DEVREQ_RECIPIENT_ENDPOINT:
        if(USB_DeviceKhciControl(&kinetis_usb_device, 
                kUSB_DeviceControlGetEndpointStatus, &ep_status) != 
                kStatus_USB_Success)
        {
            status = USBS_CONTROL_RETURN_STALL;
        }
        else
        {
            word = ep_status.endpointStatus;
            status = USBS_CONTROL_RETURN_HANDLED;
        }
      break;
    default:
        status = USBS_CONTROL_RETURN_STALL;
    }

    *((cyg_uint16*)ep0.control_buffer) = word;
    ep0.buffer_size = sizeof (word);
    return status;
  }

// Handle a get status set feature message on the control endpoint
usbs_control_return
usbs_kinetis_control_setup_set_feature(void)
{
    usbs_control_return status;
    usb_device_endpoint_status_struct_t ep_status;
    usb_devreq *req = (usb_devreq *)ep0.control_buffer;
    cyg_uint8 recipient = req->type & USB_DEVREQ_RECIPIENT_MASK;
    
    ep_status.endpointAddress = req->index_lo;
 
    status = USBS_CONTROL_RETURN_UNKNOWN;

    switch(recipient) {
    case USB_DEVREQ_RECIPIENT_DEVICE:
        status = USBS_CONTROL_RETURN_STALL;
        break;
    case USB_DEVREQ_RECIPIENT_INTERFACE:
        // Nothing to do
        break;
    case USB_DEVREQ_RECIPIENT_ENDPOINT:
        /* Set or Clear the endpoint featrue. */
        if(USB_DeviceKhciControl(&kinetis_usb_device, 
                kUSB_DeviceControlGetEndpointStatus, &ep_status) != 
                kStatus_USB_Success)
        {
            status = USBS_CONTROL_RETURN_STALL;
        }
        else
        {
            if(ep_status.endpointStatus == kUSB_DeviceEndpointStateIdle)
            {
                USB_DeviceKhciControl(&kinetis_usb_device,
                        kUSB_DeviceControlEndpointStall, req->index_lo);
                status = USBS_CONTROL_RETURN_HANDLED;
            }
            else
            {
                status = USBS_CONTROL_RETURN_STALL;
            }
        }
        break;
    default:
        status = USBS_CONTROL_RETURN_STALL;
    }
    return status;
}

// Handle a get status clear feature message on the control endpoint
usbs_control_return
usbs_kinetis_control_setup_clear_feature(void)
{
    usbs_control_return status;
    usb_device_endpoint_status_struct_t ep_status;
    usb_devreq *req = (usb_devreq *)ep0.control_buffer;
    cyg_uint8 recipient = req->type & USB_DEVREQ_RECIPIENT_MASK;

    ep_status.endpointAddress = req->index_lo;
 
    status = USBS_CONTROL_RETURN_UNKNOWN;

    switch (recipient) {
    case USB_DEVREQ_RECIPIENT_DEVICE:
        status = USBS_CONTROL_RETURN_STALL;
        break;
    case USB_DEVREQ_RECIPIENT_INTERFACE:
        // Nothing to do
        break;
    case USB_DEVREQ_RECIPIENT_ENDPOINT:
        /* Set or Clear the endpoint featrue. */
        if(USB_DeviceKhciControl(&kinetis_usb_device, 
                kUSB_DeviceControlGetEndpointStatus, &ep_status) != 
                kStatus_USB_Success)
        {
            status = USBS_CONTROL_RETURN_STALL;
        }
        else
        {
            if(ep_status.endpointStatus == kUSB_DeviceEndpointStateStalled)
            {
                USB_DeviceKhciControl(&kinetis_usb_device,
                        kUSB_DeviceControlEndpointUnstall, req->index_lo);
                status = USBS_CONTROL_RETURN_HANDLED;
            }
            else
            {
                status = USBS_CONTROL_RETURN_STALL;
            }
        }
      break;
    default:
        status = USBS_CONTROL_RETURN_STALL;
    }
    return status;
}

// Handle a setup message from the host
usbs_control_return
usbs_kinetis_control_setup()
{
    // Data are in control_buffer
    usb_devreq *req = (usb_devreq *) ep0.control_buffer;
    usbs_control_return status;
    cyg_uint8   protocol;
    cyg_uint8   usb_address;
    cyg_uint16 length;
    cyg_bool dev_to_host;
    //usbs_control_return usbcode;
    cyg_bool handled = false;
    
    length = (req->length_hi << 8) | req->length_lo;
    dev_to_host = req->type & USB_DEVREQ_DIRECTION_IN;

