Filip83/ecos-devel/ecos-3.0/packages/devs/usb/kinetis/current/src/usbc_kinetis_zaloha.c
    CYG_TRACE0( true, "Control Setup\n" );

    status = USBS_CONTROL_RETURN_STALL;

    protocol = req->type & (USB_DEVREQ_TYPE_MASK);

    if (protocol == USB_DEVREQ_TYPE_STANDARD) {
        handled = true;
        switch (req->request) {
            case USB_DEVREQ_GET_STATUS:
                status = usbs_kinetis_control_setup_get_status();
                break;
            case USB_DEVREQ_SET_ADDRESS:
                CYG_TRACE0( true, "Control Setup Set Addr\n" );
                usb_address = req->value_lo;
                USB_DeviceKhciControl(&kinetis_usb_device,
                        kUSB_DeviceControlSetDeviceAddress,&usb_address);
                ep0.state = USBS_STATE_ADDRESSED;
                usbs_state_notify(&ep0);
              break;
            case USB_DEVREQ_SET_FEATURE:
                status = usbs_kinetis_control_setup_set_feature();
                break;
            case USB_DEVREQ_CLEAR_FEATURE:
                status = usbs_kinetis_control_setup_clear_feature();
                break;
            default:
                handled = false;
        }
    }
    
    if ((protocol != USB_DEVREQ_TYPE_STANDARD) || !handled) 
    {
        // Ask the layer above to process the message
        // TODO: Neni to asi idealni
        status = usbs_parse_host_get_command (&ep0);
        ep0.buffer_size = MIN (ep0.buffer_size, length);
        if (status == USBS_CONTROL_RETURN_HANDLED)
        {
            handled = true;
            //if(ep0.fill_buffer_fn)
            {
#if 0
                cyg_uint32 pos = 0;
                memcpy(kinetis_usb_device.setupPacketBuffer,
                       ep0.buffer,ep0.buffer_size);
                pos += ep0.buffer_size;
                while(ep0.fill_buffer_fn)
                {
                    if((ep0.buffer_size + pos) < USB_SETUP_PACKET_SIZE)
                    {
                        (*ep0.fill_buffer_fn) (&ep0);
                        memcpy(kinetis_usb_device.setupPacketBuffer + pos,
                               ep0.buffer,ep0.buffer_size);
                        pos += ep0.buffer_size;
                    }
                    else
                    {
                        CYG_ASSERT(false,"USB control buffer overflow\n");
                    }					
                }		

                ep0.buffer = kinetis_usb_device.setupPacketBuffer;
                ep0.buffer_size = pos;
                USB_DeviceKhciSend(&kinetis_usb_device,0,
                        ep0.buffer, ep0.buffer_size);
                /*USB_DeviceKhciEndpointTransfer(&kinetis_usb_device,0,USB_IN,
                        ep0.buffer, ep0.buffer_size);*/
#endif
            }			

        }
        else
            handled = false;
    }
    
    if (status == USBS_CONTROL_RETURN_STALL)
    {
        cyg_uint8 epn = 0;
        USB_DeviceKhciControl(&kinetis_usb_device,
                        kUSB_DeviceControlEndpointStall,&epn);
    }
   /* else
    {
        USB_DeviceKhciPrimeNextSetup(&kinetis_usb_device);
    }*/
      
    return status;
}

// ----------------------------------------------------------------------------
// Polling support. It is not clear that this is going to work particularly
// well since according to the documentation the hardware does not generate
// NAKs automatically - instead the ISR has to set the appropriate bits
// sufficiently quickly to avoid confusing the host.
//
// Calling the isr directly avoids duplicating code, but means that
// cyg_drv_interrupt_acknowledge() will get called when not inside a
// real interrupt handler. This should be harmless.

void
usbs_kinetis_poll (usbs_control_endpoint * endpoint)
{
  CYG_ASSERT (endpoint == &ep0, "Wrong endpoint");
  if (CYG_ISR_CALL_DSR == usbs_kinetis_isr (CYGNUM_HAL_INTERRUPT_USB0, 0)) {
     usbs_kinetis_dsr (CYGNUM_HAL_INTERRUPT_USB0, 0, 0);
  }
}

// ----------------------------------------------------------------------------
// Testing support.
usbs_testing_endpoint usbs_testing_endpoints[] = {
    {
        endpoint_type       : USB_ENDPOINT_DESCRIPTOR_ATTR_CONTROL,
        endpoint_number     : 0,
        endpoint_direction  : USB_ENDPOINT_DESCRIPTOR_ENDPOINT_IN,
        endpoint            : (void*) &ep0,
#ifdef CYGVAR_DEVS_USB_AT91_EP0_DEVTAB_ENTRY
        devtab_entry        : CYGDAT_DEVS_USB_AT91_DEVTAB_BASENAME "0c",
#else
        devtab_entry        : (const char*) 0,
#endif
        min_size            : 1,            // zero-byte control transfers are meaningless
        max_size            : 0x0FFFF,      // limit imposed by protocol
        max_in_padding      : 0,
        alignment           : 0
    },
    {
        endpoint_type       : USB_ENDPOINT_DESCRIPTOR_ATTR_BULK,
        endpoint_number     : 1,
        endpoint_direction  : USB_ENDPOINT_DESCRIPTOR_ENDPOINT_OUT,
        endpoint            : (void*) &ep1,
#ifdef CYGVAR_DEVS_USB_AT91_EP1_DEVTAB_ENTRY
        devtab_entry        : CYGDAT_DEVS_USB_AT91_DEVTAB_BASENAME "1r",
#else
        devtab_entry        : (const char*) 0,
#endif
        min_size            : 1,
        max_size            : -1,           // No hardware or driver limitation
        max_in_padding      : 0,
        alignment           : 0
    },
    {
        endpoint_type       : USB_ENDPOINT_DESCRIPTOR_ATTR_BULK,
        endpoint_number     : 2,
        endpoint_direction  : USB_ENDPOINT_DESCRIPTOR_ENDPOINT_IN,
        endpoint            : (void*) &ep2,
#ifdef CYGVAR_DEVS_USB_AT91_EP2_DEVTAB_ENTRY
        devtab_entry        : CYGDAT_DEVS_USB_AT91_DEVTAB_BASENAME "2w",
#else
        devtab_entry        : (const char*) 0,
#endif
        min_size            : 1,
        max_size            : -1,           // No hardware or driver limitation
        max_in_padding      : 1,            // hardware limitation
        alignment           : 0
    },
    {
        endpoint_type       : USB_ENDPOINT_DESCRIPTOR_ATTR_BULK,
        endpoint_number     : 3,
        endpoint_direction  : USB_ENDPOINT_DESCRIPTOR_ENDPOINT_IN,
        endpoint            : (void*) &ep3,
#ifdef CYGVAR_DEVS_USB_AT91_EP3_DEVTAB_ENTRY
        devtab_entry        : CYGDAT_DEVS_USB_AT91_DEVTAB_BASENAME "3w",
#else
        devtab_entry        : (const char*) 0,
#endif
        min_size            : 1,
        max_size            : -1,           // No hardware or driver limitation
        max_in_padding      : 1,            // hardware limitation
        alignment           : 0
    },
    USBS_TESTING_ENDPOINTS_TERMINATOR
};
#endif


